<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"8e472814bb3f1d63a34f9992941095e46e8a0819c3f25bf83342c8c1e01c9274","plan_job_ref":"Job Terraform plan #32 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132794478","plan_out_hash":"a157b0ac9d1425661c0352002aa0ac49d395adb8519c4101c43be1b63da2f3d9","plan_hash":"61e7727e26096daf51cf372bc6f38c43994241c38df26001ae7514356f8b2c9a","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be created
+   resource "yandex_function" "receive-video-handler" {
+       created_at        = (known after apply)
+       entrypoint        = "ReceiveVideoHandler.Handler"
+       execution_timeout = "10"
+       folder_id         = (known after apply)
+       id                = (known after apply)
+       image_size        = (known after apply)
+       loggroup_id       = (known after apply)
+       memory            = 128
+       name              = "receive-video-handler"
+       runtime           = "dotnet8"
+       tags              = (known after apply)
+       user_hash         = "3a4a9159c39575f8f5e6721b98c5649c5ec6b6181af1dc764900687218fc9fc9"
+       version           = (known after apply)

+       content {
+           zip_filename = "./receive-video-handler.zip"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #17](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8132795833)